tugas 9/benchmark_thread/test_result_15.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        myserver/1.0
Server Hostname:        127.0.0.1
Server Port:            46000

Document Path:          /
Document Length:        4 bytes

Concurrency Level:      15
Time taken for tests:   475.540 seconds
Complete requests:      1000
Failed requests:        0
Non-2xx responses:      1000
Total transferred:      122000 bytes
HTML transferred:       4000 bytes
Requests per second:    2.10 [#/sec] (mean)
Time per request:       7133.093 [ms] (mean)
Time per request:       475.540 [ms] (mean, across all concurrent requests)
Transfer rate:          0.25 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       3
Processing:     3 6874 9610.7   2796   47698
Waiting:        2 6761 9448.7   2745   47692
Total:          5 6874 9610.7   2796   47698

Percentage of the requests served within a certain time (ms)
  50%   2796
  66%   5064
  75%   8291
  80%  10952
  90%  22269
  95%  30762
  98%  37766
  99%  41292
 100%  47698 (longest request)